data_analysis/benchmark_lrdt/ycsb/20240519_153312/cluster-default/workload_99_1_mongo/960/100000/3/transactions_5.dat
/usr/bin/java  -classpath /home/ccamilleri-prest/YCSB/conf:/home/ccamilleri-prest/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/ccamilleri-prest/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/ccamilleri-prest/YCSB/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/ccamilleri-prest/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -P workloads/lrdt/workload_99_1 -p mongodb.url=mongodb+srv://app:Mu8PfKAF9g7mr9yE6wnT@cluster-cms-pot-01-pl-0.mubeh.mongodb.net/u_cmsdb?retryWrites=true&w=majority -threads 60 -p operationcount=10000000 -p fieldlength=100 -p fieldlengthdistribution=constant -p measurementtype=timeseries -p timeseries.granularity=100 -p readrecordcount=100000 -p updaterecordcount=100000
mongo client connection created with mongodb+srv://app:Mu8PfKAF9g7mr9yE6wnT@cluster-cms-pot-01-pl-0.mubeh.mongodb.net/u_cmsdb?retryWrites=true&w=majority
[OVERALL], RunTime(ms), 60241
[OVERALL], Throughput(ops/sec), 2691.289985226009
[TOTAL_GCS_G1_Young_Generation], Count, 6
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 180
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2987998207201076
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 6
[TOTAL_GC_TIME], Time(ms), 180
[TOTAL_GC_TIME_%], Time(%), 0.2987998207201076
[READ], Operations, 160509
[READ], AverageLatency(us), 19614.13002386159
[READ], MinLatency(us), 189
[READ], MaxLatency(us), 1863310
[READ], Return=OK, 160509
[READ], 0, 867622.037735849
[READ], 100, 73693.13023255813
[READ], 200, 4615.0
[READ], 300, 26581.591836734693
[READ], 400, 40090.114503816796
[READ], 500, 85923.71830985915
[READ], 600, 6295.603864734299
[READ], 700, 31466.335892514395
[READ], 800, 10020.472543352602
[READ], 900, 18204.911439114392
[READ], 1000, 17970.375
[READ], 1100, 24406.68401486989
[READ], 1200, 18369.275862068964
[READ], 1300, 83153.5
[READ], 1400, 15399.101351351352
[READ], 1500, 12139.751773049646
[READ], 1600, 19509.093220338982
[READ], 1700, 14801.941037735849
[READ], 1800, 12691.662337662337
[READ], 1900, 13289.017199017198
[READ], 2000, 8205.6239460371
[READ], 2100, 8228.068281938326
[READ], 2200, 10832.783439490446
[READ], 2300, 21823.33962264151
[READ], 2400, 18757.534136546186
[READ], 2500, 12729.090206185567
[READ], 2600, 14506.298245614034
[READ], 2700, 10853.104100946372
[READ], 2800, 9033.945
[READ], 2900, 4485.573619631902
[READ], 3000, 7712.730158730159
[READ], 3100, 30153.956521739132
[READ], 3200, 64042.43396226415
[READ], 3300, 9716.153846153846
[READ], 3400, 11068.928229665073
[READ], 3500, 23060.484848484848
[READ], 3600, 23225.470175438597
[READ], 3700, 15231.023529411765
[READ], 3800, 10992.2125
[READ], 3900, 24276.506329113923
[READ], 4000, 23130.94786729858
[READ], 4100, 34163.952
[READ], 4200, 45453.07456140351
[READ], 4300, 30422.462068965517
[READ], 4400, 20899.755868544602
[READ], 4500, 25635.889361702128
[READ], 4600, 23400.95918367347
[READ], 4700, 13771.599369085174
[READ], 4800, 21450.074324324323
[READ], 4900, 22604.95588235294
[READ], 5000, 17252.49090909091
[READ], 5100, 22373.216666666667
[READ], 5200, 26045.982683982686
[READ], 5300, 19460.170731707316
[READ], 5400, 9787.41841004184
[READ], 5500, 15525.644444444444
[READ], 5600, 15823.270718232045
[READ], 5700, 19391.948186528498
[READ], 5800, 15158.440506329114
[READ], 5900, 12486.973384030418
[READ], 6000, 34156.59778597786
[READ], 6100, 22267.082474226805
[READ], 6200, 16301.526530612246
[READ], 6300, 14678.288961038961
[READ], 6400, 19804.62323943662
[READ], 6500, 40632.71586715867
[READ], 6600, 24995.671280276816
[READ], 6700, 25462.899224806202
[READ], 6800, 19137.906976744187
[READ], 6900, 23270.99245283019
[READ], 7000, 13019.756097560976
[READ], 7100, 15870.458193979934
[READ], 7200, 21375.85714285714
[READ], 7300, 30976.004098360656
[READ], 7400, 21736.380753138077
[READ], 7500, 9645.808580858085
[READ], 7600, 21652.603703703702
[READ], 7700, 27099.676691729324
[READ], 7800, 18867.05909090909
[READ], 7900, 21004.138576779027
[READ], 8000, 21235.69579288026
[READ], 8100, 12783.801749271137
[READ], 8200, 17718.182879377433
[READ], 8300, 13498.92290249433
[READ], 8400, 24076.863309352517
[READ], 8500, 24447.239852398525
[READ], 8600, 19854.429090909092
[READ], 8700, 12309.29347826087
[READ], 8800, 11335.133986928104
[READ], 8900, 9426.183333333332
[READ], 9000, 22929.096525096524
[READ], 9100, 12367.55135135135
[READ], 9200, 21024.17987804878
[READ], 9300, 32691.962962962964
[READ], 9400, 10481.533898305084
[READ], 9500, 19786.017182130585
[READ], 9600, 17762.258928571428
[READ], 9700, 11439.59223300971
[READ], 9800, 9686.47311827957
[READ], 9900, 21628.65470852018
[READ], 10100, 40483.1714922049
[READ], 10200, 21036.32904884319
[READ], 10300, 12090.351265822785
[READ], 10400, 26313.920634920636
[READ], 10500, 10528.67441860465
[READ], 10600, 10193.376996805111
[READ], 10700, 30788.563706563706
[READ], 10800, 21103.609649122805
[READ], 10900, 6803.014742014742
[READ], 11000, 15908.124277456647
[READ], 11100, 6688.219512195122
[READ], 11200, 16345.66149068323
[READ], 11300, 13661.864768683274
[READ], 11400, 16044.32028469751
[READ], 11500, 22222.339285714286
[READ], 11600, 46736.90594059406
[READ], 11700, 22720.087962962964
[READ], 11800, 23335.575471698114
[READ], 11900, 16393.838323353295
[READ], 12000, 19083.092105263157
[READ], 12100, 18067.221088435374
[READ], 12200, 7908.4079320113315
[READ], 12300, 19193.546125461253
[READ], 12400, 12937.77485380117
[READ], 12500, 11159.543973941369
[READ], 12600, 13785.866310160427
[READ], 12700, 13746.306201550387
[READ], 12800, 21461.377094972067
[READ], 12900, 13557.898773006134
[READ], 13000, 26765.004081632655
[READ], 13100, 42677.653696498055
[READ], 13200, 23248.422222222223
[READ], 13300, 11384.865030674846
[READ], 13400, 23316.897526501765
[READ], 13500, 19227.266968325792
[READ], 13600, 13134.200704225352
[READ], 13700, 13585.719444444445
[READ], 13800, 21772.018587360595
[READ], 13900, 20849.652671755724
[READ], 14000, 14213.0
[READ], 14100, 26123.79649122807
[READ], 14200, 17272.54480286738
[READ], 14300, 31695.131944444445
[READ], 14400, 15233.363333333333
[READ], 14500, 22908.139705882353
[READ], 14600, 32029.7903930131
[READ], 14700, 10092.539603960397
[READ], 14800, 36881.056277056276
[READ], 14900, 13368.731404958678
[READ], 15000, 21073.354085603114
[READ], 15100, 13512.815873015874
[READ], 15200, 16732.201149425287
[READ], 15300, 24375.778985507248
[READ], 15400, 12916.633986928104
[READ], 15500, 11588.003367003366
[READ], 15600, 26815.02572347267
[READ], 15700, 27607.138364779876
[READ], 15800, 23612.180952380953
[READ], 15900, 19851.06017191977
[READ], 16000, 16460.16878980892
[READ], 16100, 22026.14383561644
[READ], 16200, 28346.419847328245
[READ], 16300, 16466.520766773163
[READ], 16400, 18859.45508982036
[READ], 16500, 17045.304195804194
[READ], 16600, 16476.28971962617
[READ], 16700, 17273.35238095238
[READ], 16800, 25652.241379310344
[READ], 16900, 15933.705454545454
[READ], 17000, 12240.21130952381
[READ], 17100, 12790.85590778098
[READ], 17200, 13921.478658536585
[READ], 17300, 14893.276073619632
[READ], 17400, 38391.084388185656
[READ], 17500, 32168.084577114427
[READ], 17600, 9535.413636363637
[READ], 17700, 9941.895061728395
[READ], 17800, 10973.860714285714
[READ], 17900, 49577.920454545456
[READ], 18000, 10586.23487544484
[READ], 18100, 13688.11196911197
[READ], 18200, 20211.294444444444
[READ], 18300, 19701.82222222222
[READ], 18400, 12777.047619047618
[READ], 18500, 8913.916083916083
[READ], 18600, 24181.375968992248
[READ], 18700, 19771.775330396475
[READ], 18800, 16992.093385214008
[READ], 18900, 25413.679841897232
[READ], 19000, 25253.320634920634
[READ], 19100, 39529.4628975265
[READ], 19200, 20593.379432624115
[READ], 19300, 21786.72
[READ], 19400, 21702.738636363636
[READ], 19500, 21083.52573529412
[READ], 19600, 7904.7625
[READ], 19700, 12945.063973063972
[READ], 19800, 23601.29718875502
[READ], 19900, 45918.237068965514
[READ], 20000, 14940.4578313253
[READ], 20100, 5378.110516934046
[READ], 20200, 4983.277652370203
[READ], 20300, 37716.67669172932
[READ], 20400, 20869.15163934426
[READ], 20500, 18055.024096385543
[READ], 20600, 17669.369426751593
[READ], 20700, 16559.56179775281
[READ], 20800, 15772.697478991597
[READ], 20900, 27516.893854748603
[READ], 21000, 27520.159420289856
[READ], 21100, 18851.89750692521
[READ], 21200, 28234.06086956522
[READ], 21300, 19499.5
[READ], 21400, 21480.908759124086
[READ], 21500, 20596.195804195806
[READ], 21600, 21099.764705882353
[READ], 21700, 21382.846441947564
[READ], 21800, 7195.48
[READ], 21900, 14059.986842105263
[READ], 22000, 19207.458333333332
[READ], 22100, 25242.461971830984
[READ], 22200, 21651.385159010602
[READ], 22300, 15703.47619047619
[READ], 22400, 22030.661224489795
[READ], 22500, 11238.963076923077
[READ], 22600, 26326.94983277592
[READ], 22700, 13077.206896551725
[READ], 22800, 20447.177852348992
[READ], 22900, 25473.93253968254
[READ], 23000, 14210.524781341108
[READ], 23100, 21663.192592592593
[READ], 23200, 22146.800711743774
[READ], 23300, 11768.483974358975
[READ], 23400, 23764.45394736842
[READ], 23500, 8306.670175438596
[READ], 23600, 22997.951070336392
[READ], 23700, 22934.291139240508
[READ], 23800, 4014.63025210084
[READ], 23900, 42479.456928838954
[READ], 24000, 26637.975369458127
[READ], 24100, 22629.927756653993
[READ], 24200, 20819.341463414636
[READ], 24300, 21661.52027027027
[READ], 24400, 5964.2806451612905
[READ], 24500, 32573.1646090535
[READ], 24600, 20612.06557377049
[READ], 24700, 24238.93388429752
[READ], 24800, 20553.63054187192
[READ], 24900, 21568.77971014493
[READ], 25000, 26513.363636363636
[READ], 25100, 23859.748898678416
[READ], 25200, 21468.585185185184
[READ], 25300, 19281.670967741935
[READ], 25400, 20969.618518518517
[READ], 25500, 20131.22
[READ], 25600, 12964.18918918919
[READ], 25700, 10266.80269058296
[READ], 25800, 41663.17117117117
[READ], 25900, 6300.424778761062
[READ], 26000, 30740.179930795846
[READ], 26100, 20586.21771217712
[READ], 26200, 22766.564853556487
[READ], 26300, 9823.06956521739
[READ], 26400, 32790.840579710144
[READ], 26500, 10214.794871794871
[READ], 26600, 14197.264604810996
[READ], 26700, 32214.604166666668
[READ], 26800, 9644.51194539249
[READ], 26900, 11592.667896678966
[READ], 27000, 18474.890995260663
[READ], 27100, 24065.53469387755
[READ], 27200, 33194.43540669856
[READ], 27300, 25052.24
[READ], 27400, 23654.014492753624
[READ], 27500, 12468.546875
[READ], 27600, 19950.6468401487
[READ], 27700, 30126.727626459146
[READ], 27800, 17341.78523489933
[READ], 27900, 20478.31923076923
[READ], 28000, 15492.518151815182
[READ], 28100, 12640.005555555555
[READ], 28200, 22174.296442687748
[READ], 28300, 25394.52786885246
[READ], 28400, 18321.361486486487
[READ], 28500, 20258.554112554113
[READ], 28600, 12120.233552631578
[READ], 28700, 17411.19806763285
[READ], 28800, 29940.191082802547
[READ], 28900, 40091.852040816324
[READ], 29000, 20276.456747404845
[READ], 29100, 23644.34928229665
[READ], 29200, 23456.809523809523
[READ], 29300, 22602.139344262294
[READ], 29400, 9511.797570850202
[READ], 29500, 14356.637404580153
[READ], 29600, 9567.973684210527
[READ], 29700, 28684.067741935483
[READ], 29800, 31917.988593155893
[READ], 29900, 12819.134246575342
[READ], 30000, 19795.9076433121
[READ], 30100, 21516.389344262294
[READ], 30200, 21349.04794520548
[READ], 30300, 18220.32958801498
[READ], 30400, 18617.903703703705
[READ], 30500, 23263.64734299517
[READ], 30600, 26442.661870503598
[READ], 30700, 11596.939716312057
[READ], 30800, 26066.64680851064
[READ], 30900, 27559.03125
[READ], 31000, 23333.850574712644
[READ], 31100, 20543.470588235294
[READ], 31200, 19387.02139037433
[READ], 31300, 21571.6
[READ], 31400, 23731.07114624506
[READ], 31500, 16857.158450704224
[READ], 31600, 18380.835664335664
[READ], 31700, 30283.600985221674
[READ], 31800, 10765.564668769715
[READ], 31900, 22743.623574144487
[READ], 32000, 19695.190839694656
[READ], 32100, 27725.8127090301
[READ], 32200, 20403.689393939392
[READ], 32300, 24307.93385214008
[READ], 32400, 18204.98561151079
[READ], 32500, 19678.189003436426
[READ], 32600, 23963.148305084746
[READ], 32700, 14938.675241157556
[READ], 32800, 6103.268
[READ], 32900, 10746.127659574468
[READ], 33000, 12233.134670487107
[READ], 33100, 49492.92905405405
[READ], 33200, 21392.26334519573
[READ], 33300, 18698.99661016949
[READ], 33400, 11035.767025089606
[READ], 33500, 33711.676855895195
[READ], 33600, 19916.08754208754
[READ], 33700, 9667.872727272726
[READ], 33800, 11149.130136986301
[READ], 33900, 29926.236486486487
[READ], 34000, 16136.319488817891
[READ], 34100, 29150.596226415095
[READ], 34200, 27319.32663316583
[READ], 34300, 10145.755172413794
[READ], 34400, 9675.744680851063
[READ], 34500, 18854.648221343872
[READ], 34600, 20753.125
[READ], 34700, 25093.08510638298
[READ], 34800, 21127.53376205788
[READ], 34900, 21541.482213438736
[READ], 35000, 21495.51388888889
[READ], 35100, 21320.045454545456
[READ], 35200, 21335.017482517484
[READ], 35300, 16830.705479452055
[READ], 35400, 19719.84364820847
[READ], 35500, 19401.897526501765
[READ], 35600, 22983.460317460318
[READ], 35700, 21501.10357142857
[READ], 35800, 21520.728301886793
[READ], 35900, 21344.43321299639
[READ], 36000, 19795.54074074074
[READ], 36100, 14105.273092369478
[READ], 36200, 18601.556390977443
[READ], 36300, 11219.003012048193
[READ], 36400, 12215.138157894737
[READ], 36500, 14123.150537634408
[READ], 36600, 14869.811046511628
[READ], 36700, 12774.460093896714
[READ], 36800, 21859.505836575874
[READ], 36900, 46178.707207207204
[READ], 37000, 11354.333333333334
[READ], 37100, 9402.716171617161
[READ], 37200, 2227.420253164557
[READ], 37300, 15378.286486486486
[READ], 37400, 12493.5818815331
[READ], 37500, 10034.60546875
[READ], 37600, 17486.170731707316
[READ], 37700, 9491.089201877934
[READ], 37800, 16378.036697247706
[READ], 37900, 27234.241007194243
[READ], 38000, 32449.143958868895
[READ], 38100, 8408.820652173914
[READ], 38200, 10190.202797202797
[READ], 38300, 12503.071264367816
[READ], 38400, 7100.035842293907
[READ], 38500, 3910.981884057971
[READ], 38600, 18202.826923076922
[READ], 38700, 46801.50505050505
[READ], 38800, 5346.270348837209
[READ], 38900, 31240.04593639576
[READ], 39000, 16927.48432055749
[READ], 39100, 15123.460317460318
[READ], 39200, 13032.317204301075
[READ], 39300, 32248.585657370517
[READ], 39400, 14230.840579710144
[READ], 39500, 11043.80459770115
[READ], 39600, 7040.534351145038
[READ], 39700, 17854.185758513933
[READ], 39800, 23679.36046511628
[READ], 39900, 6864.068119891008
[READ], 40000, 25650.975
[READ], 40100, 21608.506329113923
[READ], 40200, 22704.18875502008
[READ], 40300, 20715.777777777777
[READ], 40400, 20146.051383399208
[READ], 40500, 19437.81081081081
[READ], 40600, 16903.314878892732
[READ], 40700, 9914.389705882353
[READ], 40800, 32821.12393162393
[READ], 40900, 19638.151408450703
[READ], 41000, 11267.882352941177
[READ], 41100, 13578.929629629629
[READ], 41200, 17815.638795986622
[READ], 41300, 38667.58741258741
[READ], 41400, 18270.63694267516
[READ], 41500, 14002.697841726618
[READ], 41600, 9108.260416666666
[READ], 41700, 9702.656826568265
[READ], 41800, 15807.058020477816
[READ], 41900, 15371.769811320755
[READ], 42000, 6045.08280254777
[READ], 42100, 27460.271565495208
[READ], 42200, 10504.439873417721
[READ], 42300, 10315.163346613546
[READ], 42400, 34351.682619647356
[READ], 42500, 18091.098712446354
[READ], 42600, 7749.126865671642
[READ], 42700, 34765.91949152543
[READ], 42800, 16710.389473684212
[READ], 42900, 15382.577259475218
[READ], 43000, 17368.52027027027
[READ], 43100, 14107.820105820107
[READ], 43200, 17943.587692307694
[READ], 43300, 20215.877952755905
[READ], 43400, 10338.568548387097
[READ], 43500, 17424.522900763357
[READ], 43600, 10530.480701754386
[READ], 43700, 14648.734439834025
[READ], 43800, 41035.24436090225
[READ], 43900, 25091.75641025641
[READ], 44000, 13398.203296703297
[READ], 44100, 12774.067857142858
[READ], 44200, 25239.980392156864
[READ], 44300, 29824.783216783217
[READ], 44400, 16848.155303030304
[READ], 44500, 23820.967153284673
[READ], 44600, 21198.106761565836
[READ], 44700, 23107.31950207469
[READ], 44800, 12601.596153846154
[READ], 44900, 18954.2654028436
[READ], 45000, 29624.07423580786
[READ], 45100, 27637.352713178294
[READ], 45200, 9146.725694444445
[READ], 45300, 4822.944444444444
[READ], 45400, 10538.686131386861
[READ], 45500, 38119.5918367347
[READ], 45600, 11761.481595092024
[READ], 45700, 8761.698060941828
[READ], 45800, 32709.0625
[READ], 45900, 21898.771812080537
[READ], 46000, 8324.364620938628
[READ], 46100, 9956.885885885886
[READ], 46200, 22033.135714285716
[READ], 46300, 23665.752066115703
[READ], 46400, 23595.158914728683
[READ], 46500, 32755.192139737992
[READ], 46600, 19266.979838709678
[READ], 46700, 14093.563176895306
[READ], 46800, 23156.016666666666
[READ], 46900, 31160.991701244813
[READ], 47000, 23693.549242424244
[READ], 47100, 14316.490494296579
[READ], 47200, 36019.72522522522
[READ], 47300, 22595.774436090225
[READ], 47400, 23806.72558139535
[READ], 47500, 13957.468085106382
[READ], 47600, 20218.508196721312
[READ], 47700, 16831.799256505576
[READ], 47800, 11353.902255639097
[READ], 47900, 15460.952802359881
[READ], 48000, 22818.942148760332
[READ], 48100, 23995.975
[READ], 48200, 25677.26923076923
[READ], 48300, 2883.145631067961
[READ], 48400, 12902.74844720497
[READ], 48500, 17364.809885931558
[READ], 48600, 17688.50677506775
[READ], 48700, 13672.47077922078
[READ], 48800, 27068.154135338347
[READ], 48900, 25873.191489361703
[READ], 49000, 14810.181069958848
[READ], 49100, 35451.94693877551
[READ], 49200, 11909.677966101695
[READ], 49300, 17612.463126843657
[READ], 49400, 14245.474264705883
[READ], 49500, 22401.860169491527
[READ], 49600, 12256.134275618375
[READ], 49700, 15866.474418604652
[READ], 49800, 19980.299035369775
[READ], 49900, 14876.615658362989
[READ], 50000, 20551.353790613717
[READ], 50100, 18868.18276762402
[READ], 50200, 10094.741847826086
[READ], 50300, 38935.94805194805
[READ], 50400, 19385.369811320754
[READ], 50500, 4911.601796407185
[READ], 50600, 13694.13875598086
[READ], 50700, 21938.61570247934
[READ], 50800, 21293.06766917293
[READ], 50900, 33491.68032786885
[READ], 51000, 36173.99585062241
[READ], 51100, 24148.553488372094
[READ], 51200, 12957.371517027865
[READ], 51300, 21396.428571428572
[READ], 51400, 19565.21186440678
[READ], 51500, 14557.110367892976
[READ], 51600, 18615.46325878594
[READ], 51700, 7215.36
[READ], 51800, 7837.114285714286
[READ], 51900, 9624.15050167224
[READ], 52000, 15185.557894736841
[READ], 52100, 22267.524324324324
[READ], 52200, 22859.741279069767
[READ], 52300, 32521.169082125605
[READ], 52400, 15868.648
[READ], 52500, 27423.289808917198
[READ], 52600, 18020.021276595744
[READ], 52700, 22969.643884892088
[READ], 52800, 22017.035856573704
[READ], 52900, 32039.8672985782
[READ], 53000, 11725.0823798627
[READ], 53100, 24195.310344827587
[READ], 53200, 11456.84659090909
[READ], 53300, 24187.219626168226
[READ], 53400, 13221.03804347826
[READ], 53500, 19553.27802690583
[READ], 53600, 42539.640569395015
[READ], 53700, 21274.1027027027
[READ], 53800, 15962.262773722628
[READ], 53900, 15566.483271375464
[READ], 54000, 15323.218623481782
[READ], 54100, 21686.150943396227
[READ], 54200, 15129.229074889869
[READ], 54300, 17919.26446280992
[READ], 54400, 19847.37786259542
[READ], 54500, 14804.567567567568
[READ], 54600, 41274.50413223141
[READ], 54700, 20747.575187969924
[READ], 54800, 46564.969348659004
[READ], 54900, 11178.665562913908
[READ], 55000, 10469.567944250872
[READ], 55100, 20265.594890510947
[READ], 55200, 33054.989726027394
[READ], 55300, 10375.653731343284
[READ], 55400, 16127.875444839858
[READ], 55500, 19762.49816849817
[READ], 55600, 14040.550522648084
[READ], 55700, 15235.440433212996
[READ], 55800, 11511.685714285713
[READ], 55900, 9722.30223880597
[READ], 56000, 34464.54098360656
[READ], 56100, 28747.417910447763
[READ], 56200, 10251.492822966507
[READ], 56300, 2930.7801418439717
[READ], 56400, 7786.320754716981
[READ], 56500, 12782.353503184713
[READ], 56600, 17194.073170731706
[READ], 56700, 54081.19758064516
[READ], 56800, 6351.460704607046
[READ], 56900, 24208.911111111112
[READ], 57000, 21398.54098360656
[READ], 57100, 23183.079037800686
[READ], 57200, 11992.930041152264
[READ], 57300, 19507.69551282051
[READ], 57400, 51261.18421052631
[READ], 57500, 238816.55555555556
[CLEANUP], Operations, 60
[CLEANUP], AverageLatency(us), 337.28333333333336
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 20220
[CLEANUP], 0, 0.23529411764705882
[CLEANUP], 100, 0.625
[CLEANUP], 200, 20220.0
[UPDATE], Operations, 1617
[UPDATE], AverageLatency(us), 242707.70006184292
[UPDATE], MinLatency(us), 5511
[UPDATE], MaxLatency(us), 1858660
[UPDATE], Return=OK, 1617
[UPDATE], 0, 21476.0
[UPDATE], 200, 1009547.0
[UPDATE], 300, 5511.0
[UPDATE], 400, 10434.0
[UPDATE], 500, 6889.0
[UPDATE], 600, 11931.0
[UPDATE], 700, 12034.375
[UPDATE], 800, 10056.111111111111
[UPDATE], 900, 33187.0
[UPDATE], 1000, 30617.2
[UPDATE], 1100, 41587.5
[UPDATE], 1200, 85610.5
[UPDATE], 1400, 21097.75
[UPDATE], 1500, 54729.0
[UPDATE], 1600, 23476.333333333332
[UPDATE], 1700, 18730.0
[UPDATE], 2000, 224030.33333333334
[UPDATE], 2100, 192141.72727272726
[UPDATE], 2300, 463031.0
[UPDATE], 2700, 721924.1666666666
[UPDATE], 2800, 492634.0
[UPDATE], 2900, 529423.5
[UPDATE], 3000, 466039.0
[UPDATE], 3200, 340733.8461538461
[UPDATE], 3400, 592200.0
[UPDATE], 3500, 327422.0
[UPDATE], 3600, 286636.6
[UPDATE], 3800, 267922.0
[UPDATE], 3900, 174344.33333333334
[UPDATE], 4000, 387644.3333333333
[UPDATE], 4100, 204988.66666666666
[UPDATE], 4200, 153808.0
[UPDATE], 4300, 147996.5
[UPDATE], 4400, 157937.0
[UPDATE], 4500, 176916.0
[UPDATE], 4600, 163505.5
[UPDATE], 4900, 214439.875
[UPDATE], 5000, 160174.33333333334
[UPDATE], 5100, 158950.2
[UPDATE], 5200, 87371.0
[UPDATE], 5300, 100499.0
[UPDATE], 5400, 93612.0
[UPDATE], 5500, 268818.0
[UPDATE], 5600, 113210.0
[UPDATE], 5700, 193420.33333333334
[UPDATE], 5800, 456589.0
[UPDATE], 6000, 137560.16666666666
[UPDATE], 6200, 91056.25
[UPDATE], 6300, 54349.5
[UPDATE], 6400, 56902.8
[UPDATE], 6700, 160353.25
[UPDATE], 6800, 101729.0
[UPDATE], 6900, 129211.0
[UPDATE], 7000, 129856.0
[UPDATE], 7200, 223295.0
[UPDATE], 7300, 173157.0
[UPDATE], 7400, 179904.66666666666
[UPDATE], 7700, 265968.7
[UPDATE], 7800, 154431.0
[UPDATE], 7900, 126859.5
[UPDATE], 8000, 108614.85714285714
[UPDATE], 8300, 218822.42857142858
[UPDATE], 8400, 116789.33333333333
[UPDATE], 8500, 170706.0
[UPDATE], 8600, 89247.0
[UPDATE], 9000, 292770.4285714286
[UPDATE], 9100, 104387.44444444444
[UPDATE], 9400, 269769.0
[UPDATE], 9500, 272428.0
[UPDATE], 9600, 223275.25
[UPDATE], 9900, 135429.77777777778
[UPDATE], 10000, 149702.0
[UPDATE], 10200, 153585.75
[UPDATE], 10400, 189996.0
[UPDATE], 10500, 220337.0
[UPDATE], 10600, 297189.0
[UPDATE], 10700, 452476.0
[UPDATE], 10800, 395952.0
[UPDATE], 11100, 336977.8
[UPDATE], 11200, 400331.7
[UPDATE], 11300, 194818.0
[UPDATE], 11600, 358425.3333333333
[UPDATE], 11700, 335132.1111111111
[UPDATE], 11800, 170357.4
[UPDATE], 11900, 135749.16666666666
[UPDATE], 12000, 119283.8
[UPDATE], 12300, 116767.83333333333
[UPDATE], 12400, 77096.66666666667
[UPDATE], 12500, 91747.0
[UPDATE], 12700, 185877.33333333334
[UPDATE], 12800, 208889.75
[UPDATE], 12900, 211594.33333333334
[UPDATE], 13000, 176799.66666666666
[UPDATE], 13100, 277100.6666666667
[UPDATE], 13200, 121452.5
[UPDATE], 13400, 197898.0
[UPDATE], 13500, 121220.33333333333
[UPDATE], 13600, 199417.66666666666
[UPDATE], 13700, 252493.0
[UPDATE], 13800, 194603.63636363635
[UPDATE], 13900, 98483.0
[UPDATE], 14000, 92713.8
[UPDATE], 14100, 90607.0
[UPDATE], 14200, 59886.25
[UPDATE], 14300, 62313.0
[UPDATE], 14400, 54307.0
[UPDATE], 14600, 79121.0
[UPDATE], 14900, 212107.8
[UPDATE], 15400, 414671.5833333333
[UPDATE], 15500, 265539.875
[UPDATE], 15600, 158635.0
[UPDATE], 15700, 153317.0
[UPDATE], 15800, 212535.66666666666
[UPDATE], 15900, 187326.14285714287
[UPDATE], 16100, 271794.0
[UPDATE], 16200, 220467.66666666666
[UPDATE], 16400, 218595.4
[UPDATE], 16600, 108714.0
[UPDATE], 16700, 200683.66666666666
[UPDATE], 17000, 388849.0
[UPDATE], 17100, 297839.6666666667
[UPDATE], 17300, 665421.0
[UPDATE], 17400, 207041.15384615384
[UPDATE], 17500, 120943.25
[UPDATE], 18000, 281219.375
[UPDATE], 18100, 308955.0
[UPDATE], 18200, 307431.0
[UPDATE], 18700, 508614.45454545453
[UPDATE], 18800, 238165.625
[UPDATE], 18900, 135203.33333333334
[UPDATE], 19000, 121062.0
[UPDATE], 19200, 120050.33333333333
[UPDATE], 19400, 76036.75
[UPDATE], 19500, 83799.33333333333
[UPDATE], 20100, 375859.55555555556
[UPDATE], 20200, 235901.77777777778
[UPDATE], 20300, 117898.75
[UPDATE], 20400, 163159.4
[UPDATE], 20500, 107165.0
[UPDATE], 20600, 91837.66666666667
[UPDATE], 20700, 76362.0
[UPDATE], 20800, 119257.0
[UPDATE], 21000, 249573.0
[UPDATE], 21100, 189252.0
[UPDATE], 21200, 96673.16666666667
[UPDATE], 21300, 89917.0
[UPDATE], 21400, 119002.0
[UPDATE], 21500, 89587.0
[UPDATE], 21600, 88701.25
[UPDATE], 21700, 67578.66666666667
[UPDATE], 22000, 203549.8
[UPDATE], 22100, 77478.0
[UPDATE], 22200, 141510.0
[UPDATE], 22300, 208660.0
[UPDATE], 22400, 171720.57142857142
[UPDATE], 22600, 172152.4
[UPDATE], 22800, 157091.33333333334
[UPDATE], 22900, 109942.6
[UPDATE], 23000, 114931.66666666667
[UPDATE], 23100, 95593.8
[UPDATE], 23200, 75599.0
[UPDATE], 23400, 159061.66666666666
[UPDATE], 23600, 258028.0
[UPDATE], 23700, 192991.75
[UPDATE], 23800, 291149.0
[UPDATE], 23900, 153548.0
[UPDATE], 24000, 165768.0
[UPDATE], 24100, 123481.75
[UPDATE], 24200, 94416.0
[UPDATE], 24300, 159900.0
[UPDATE], 24400, 209923.5
[UPDATE], 24500, 168021.0
[UPDATE], 24700, 94146.4
[UPDATE], 24900, 133261.0
[UPDATE], 25000, 142200.33333333334
[UPDATE], 25100, 111034.0
[UPDATE], 25300, 139665.88888888888
[UPDATE], 25400, 116963.0
[UPDATE], 25500, 88102.66666666667
[UPDATE], 25600, 177112.0
[UPDATE], 25700, 229402.0
[UPDATE], 25800, 280487.5714285714
[UPDATE], 25900, 212051.85714285713
[UPDATE], 26000, 159596.75
[UPDATE], 26100, 98341.0
[UPDATE], 26200, 87581.0
[UPDATE], 26400, 139572.75
[UPDATE], 27000, 467044.3333333333
[UPDATE], 27100, 517748.625
[UPDATE], 27500, 323800.5
[UPDATE], 27600, 262343.22222222225
[UPDATE], 27700, 132109.0
[UPDATE], 27800, 72588.0
[UPDATE], 27900, 79297.0
[UPDATE], 28000, 87311.0
[UPDATE], 28100, 197113.0
[UPDATE], 28300, 219519.57142857142
[UPDATE], 28500, 70127.0
[UPDATE], 28600, 73492.0
[UPDATE], 28700, 144372.33333333334
[UPDATE], 28800, 164523.0
[UPDATE], 28900, 118865.0
[UPDATE], 29100, 178418.14285714287
[UPDATE], 29200, 138073.0
[UPDATE], 29300, 124167.0
[UPDATE], 29500, 206513.0
[UPDATE], 29700, 312198.22222222225
[UPDATE], 29800, 343741.0
[UPDATE], 29900, 201673.88888888888
[UPDATE], 30000, 152703.0
[UPDATE], 30100, 82807.33333333333
[UPDATE], 30200, 88971.5
[UPDATE], 30300, 94996.0
[UPDATE], 30600, 165438.88888888888
[UPDATE], 30800, 187691.66666666666
[UPDATE], 30900, 201475.0
[UPDATE], 31000, 109877.0
[UPDATE], 31100, 80025.66666666667
[UPDATE], 31200, 88483.0
[UPDATE], 31400, 160739.2857142857
[UPDATE], 31500, 129075.0
[UPDATE], 31700, 159654.66666666666
[UPDATE], 31800, 158669.66666666666
[UPDATE], 31900, 140672.6
[UPDATE], 32100, 126276.4
[UPDATE], 32200, 142413.66666666666
[UPDATE], 32300, 79867.8
[UPDATE], 32400, 95867.0
[UPDATE], 32500, 105069.75
[UPDATE], 32600, 118853.0
[UPDATE], 32700, 99268.5
[UPDATE], 32900, 211575.88888888888
[UPDATE], 33000, 79212.6
[UPDATE], 33100, 102350.33333333333
[UPDATE], 33200, 93087.0
[UPDATE], 33300, 52702.0
[UPDATE], 33600, 138928.25
[UPDATE], 33900, 164971.5
[UPDATE], 34100, 131139.16666666666
[UPDATE], 34200, 172474.75
[UPDATE], 34300, 207833.5
[UPDATE], 34700, 304232.86666666664
[UPDATE], 34800, 128829.25
[UPDATE], 34900, 85123.5
[UPDATE], 35100, 81158.5
[UPDATE], 35300, 80533.0
[UPDATE], 35400, 121015.0
[UPDATE], 35500, 136624.83333333334
[UPDATE], 35600, 73723.5
[UPDATE], 35700, 172311.5
[UPDATE], 35800, 121680.33333333333
[UPDATE], 35900, 67324.0
[UPDATE], 36000, 65179.333333333336
[UPDATE], 36100, 190144.2
[UPDATE], 36200, 187637.2
[UPDATE], 37100, 686427.6363636364
[UPDATE], 37200, 652245.8333333334
[UPDATE], 37300, 421507.0
[UPDATE], 37400, 551747.25
[UPDATE], 37500, 467932.0
[UPDATE], 37600, 474154.5
[UPDATE], 37700, 597807.8
[UPDATE], 37900, 734641.0
[UPDATE], 38000, 641415.6666666666
[UPDATE], 38100, 381520.55555555556
[UPDATE], 38700, 475996.6666666667
[UPDATE], 38800, 398776.0
[UPDATE], 38900, 470081.0
[UPDATE], 39000, 499669.0
[UPDATE], 39100, 869606.0
[UPDATE], 39300, 860268.8571428572
[UPDATE], 39400, 520417.84210526315
[UPDATE], 39500, 289209.0
[UPDATE], 39700, 411838.0
[UPDATE], 39800, 497751.14285714284
[UPDATE], 39900, 275913.1
[UPDATE], 40000, 138270.5
[UPDATE], 40100, 179683.66666666666
[UPDATE], 40200, 134271.5
[UPDATE], 40300, 81373.0
[UPDATE], 40400, 96403.5
[UPDATE], 40500, 92730.66666666667
[UPDATE], 40600, 155498.0
[UPDATE], 40800, 295925.0
[UPDATE], 40900, 263989.5
[UPDATE], 41000, 305009.0
[UPDATE], 41100, 341103.0
[UPDATE], 41300, 309464.6
[UPDATE], 41400, 411937.0
[UPDATE], 41500, 216479.0
[UPDATE], 41800, 415043.0
[UPDATE], 41900, 327865.26666666666
[UPDATE], 42000, 165234.0
[UPDATE], 42400, 564299.0
[UPDATE], 42500, 459999.375
[UPDATE], 42700, 402243.5
[UPDATE], 42800, 326090.2727272727
[UPDATE], 42900, 180334.0
[UPDATE], 43000, 126117.0
[UPDATE], 43100, 191451.0
[UPDATE], 43200, 184781.0
[UPDATE], 43400, 219765.0
[UPDATE], 43700, 406060.6666666667
[UPDATE], 43800, 266726.4
[UPDATE], 43900, 48025.0
[UPDATE], 44000, 44475.5
[UPDATE], 44100, 244700.0
[UPDATE], 44200, 379201.0
[UPDATE], 44300, 189894.0
[UPDATE], 44400, 123245.7
[UPDATE], 44600, 136136.33333333334
[UPDATE], 44700, 99628.2
[UPDATE], 45200, 355503.4285714286
[UPDATE], 45300, 382451.8
[UPDATE], 45400, 402398.0
[UPDATE], 45600, 303200.5
[UPDATE], 45700, 283806.0
[UPDATE], 45900, 365973.0
[UPDATE], 46000, 213073.25
[UPDATE], 46100, 99046.5
[UPDATE], 46200, 71693.0
[UPDATE], 46300, 62690.0
[UPDATE], 46400, 175039.66666666666
[UPDATE], 46500, 98323.8
[UPDATE], 46600, 47836.5
[UPDATE], 46700, 1168707.5
[UPDATE], 46800, 160978.0
[UPDATE], 46900, 117730.0
[UPDATE], 47000, 113937.0
[UPDATE], 47200, 272743.5
[UPDATE], 47300, 203368.5
[UPDATE], 47400, 113339.33333333333
[UPDATE], 48200, 689748.6
[UPDATE], 48300, 413550.75
[UPDATE], 48400, 461844.6
[UPDATE], 48500, 99254.5
[UPDATE], 49200, 466678.78571428574
[UPDATE], 49300, 277450.5
[UPDATE], 49400, 245018.0
[UPDATE], 49500, 133632.0
[UPDATE], 50000, 591746.0
[UPDATE], 50100, 330906.73333333334
[UPDATE], 50500, 219966.4
[UPDATE], 50600, 209714.5
[UPDATE], 50700, 328400.75
[UPDATE], 50800, 316471.0
[UPDATE], 50900, 91152.5
[UPDATE], 51000, 654921.0
[UPDATE], 51100, 188304.33333333334
[UPDATE], 51200, 171882.75
[UPDATE], 51400, 176292.0
[UPDATE], 51500, 209876.75
[UPDATE], 51900, 26343.0
[UPDATE], 52100, 218113.66666666666
[UPDATE], 52200, 330180.6
[UPDATE], 52300, 189035.9
[UPDATE], 52400, 514546.0
[UPDATE], 52500, 151114.0
[UPDATE], 52600, 153331.75
[UPDATE], 52700, 104309.66666666667
[UPDATE], 52800, 82776.14285714286
[UPDATE], 52900, 129781.0
[UPDATE], 53000, 149560.0
[UPDATE], 53100, 189206.0
[UPDATE], 53300, 313452.0
[UPDATE], 53400, 325830.0
[UPDATE], 53500, 273793.0
[UPDATE], 53600, 186569.75
[UPDATE], 53700, 146333.0
[UPDATE], 53900, 197494.75
[UPDATE], 54000, 85323.0
[UPDATE], 54100, 76570.0
[UPDATE], 54200, 76963.0
[UPDATE], 54300, 71798.25
[UPDATE], 54400, 273203.3333333333
[UPDATE], 54500, 107401.5
[UPDATE], 54600, 1048019.0
[UPDATE], 54700, 100274.0
[UPDATE], 54800, 722887.0
[UPDATE], 55200, 250461.54545454544
[UPDATE], 55500, 241909.0
[UPDATE], 56200, 697438.25
[UPDATE], 56300, 496366.9
[UPDATE], 56400, 409999.0
[UPDATE], 56500, 258713.5
[UPDATE], 56600, 124018.66666666667
[UPDATE], 56900, 228805.5
[UPDATE], 57000, 255381.4
[UPDATE], 57100, 240275.2
[UPDATE], 57200, 208259.0
[UPDATE], 57300, 218840.0
[UPDATE], 57400, 154446.66666666666